##  메모리 내 데이터 구조 저장소 빠른가이드
1. Redis의 키아래에 데이터 저장
2. Redis의 키를 사용하여 데이터 검색
3. 키스페이스에서 특정 패턴과 일치하는 키를 스캔

Redis Cloud로 빠른 스타트(지침에 따라 데이터베이스를 만들어본다.) 또는 설치 가이드에 따라 로컬 컴퓨터에 Redis설치가능

---

## 로컬 설치
Docker만 사용 OS 및 배포판에 대한 설치 지침을 확인
[Install Redis Open Source](https://redis.io/docs/latest/operate/oss_and_stack/install/install-stack/)
[Run Redis Open Source on Docker](https://redis.io/docs/latest/operate/oss_and_stack/install/install-stack/docker/)

[Install Redis Open Source on Linux](https://redis.io/docs/latest/operate/oss_and_stack/install/install-stack/apt/)
> How to install Redis Open Source using APT

[Install Redis Open Source on Linux](https://redis.io/docs/latest/operate/oss_and_stack/install/install-stack/rpm/)
> How to install Redis Open Source using RPM

[Install Redis Open Source on Linux](https://redis.io/docs/latest/operate/oss_and_stack/install/install-stack/snap/)
> How to install Redis Open Source using Snap

### **도커로 설치**

**1. 도커에서 레디스 오픈 소스 실행**
redis 이미지를 사용해서 redis오픈 소스 서버를 시작하려면 터미널에 다음을 입력
```bash
docker run -d --name redis -p 6379:6379 redis:<version>
```

**2. redis-cli로 연결**
redis-cli가 로컬에 설치 x 시 도커 컨테이너에서 실행가능
```bash
docker exec -it redis redis-cli
```
redis-cli 로컬에 설치가되어 있는 경우 터미널에서 실행가능
```bash
redis-cli -h 127.0.0.1 -p 6379
```

로컬 구성  파일 사용
다음중  하나를 수행할수있다.

컨텍스트에서 /data/ 로 redis.conf 를  추가하는 자체 도커파일을 만들수있다.
```dockerfile
FROM redis
COPY redis.conf /usr/local/etc/redis/redis.conf
CMD [ "redis-server", "/usr/local/etc/redis/redis.conf"]
```
 또는 docker run 옵션을 이용하여 동일한 줄을 따라 무언가를 지정할수있다.
 ```bash
 docker run -v /myredis/conf:/usr/local/etc/redis --name myredis redis redis-sever /usr/local/etc/redis/redis.conf
 ```
 > 여기서 / myredis/conf / 는 redis.conf 파일이 포함된 로컬 디렉토리이다. 이방법을 사용하면 레디스 컨테이너에 대한 도커파일이 필요하지 않다.
 
 ---

##  연결
예제는 localhost(-h 127.0.0.1)에서 실행되고 기본 포트(-p 6379)에서  수신 대기하는 레디스 서버에  연결하는 방법을 보여줌
```redis-cli
redis-cli -h 127.0.0.1 -p 6379
```

---

## 데이터 저장 및  검색
Redis는 원격 사전 서버의 약자이다.(Remote Dicionary Server), 로컬 프로그래밍 환경에서와 동일한 데이터 유형을 사용할 수 있지만, 레디스 내에 서버  측에서 사용할수있다.

바이트 배열*byte arrays*, 와 유사하게 Redis는 문자열은  텍스트, 직렬화된 객체(serialized objects), 카운터 값 및 이진 배열을 포함한 바이트 시퀸스를 저장한다. 다음 예제는 문자열 값을 설정하고 가져오는 방법
``` redis-cli
SET bike:1 "Process 134"
GET bike:1
```
 해시는 딕셔너리또는 해시  맵과 동일, 무엇보다  해시를 사용하여 일반 개체를 나타내고 카운터 그룹을 저장할수있다. 다음예제는 개체의 필드 값을 설정하고 엑세스하는 방법 (필드와 값을 저장한다.)
 ```redis-cli
 > HSET bike:1 modle Deimos brand Ergonmon type 'Enduro bikes' price 4972
 (integer) 4
 > HGET bike:1 model
 "Deimos"
 > HGET bike:1 price
 "4972"
 > HGETALL bike:1
1) "model"
2) "Deimos"
3) "brand"
4) "Ergonmon"
5) "type"
6) "Enduro bikes"
7) "price"
8) "4972"
 ```
---
## 키스페이스 스캔
Redis 내에 각 항목에는 고유한 키가 있다. 모든  항목은 Redis 키스페이스 내에 있다. SCAN명령을 통해 Redis 키스페이스를 스캔할 수 있다. 다음은 접두사 bike가 있는 처음 100개의 키를 스캔하는 예이다.
```redis-cli
SCAN  0 MATCH "bike:*" COUNT 100
```
SCAN은 커서 위치를  반환하여 커서  값 0에 도달할 때까지 다음 키 배치를 반복적으로 스캔할수있다.

---
## 다음 단계

---

## 이론
[[What is a Key-Value Database?]]